# HasValidAlphanumericRevisionSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..HasValidAlphanumericRevisionSettings Method
RevisionNumberingSequence Class See Also
---
Checks whether the revision numbering sequence owns a valid alphanumeric revision settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HasValidAlphanumericRevisionSettings()
```

Visual Basic
---
```text
Public Function HasValidAlphanumericRevisionSettings As Boolean
```

Visual C++
---
```text
public:
bool HasValidAlphanumericRevisionSettings()
```

# ### Return Value
True if the revision numbering sequence owns a valid alphanumeric revision settings.
# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace